package bw.com.day13_dome;

import java.io.Serializable;
import java.util.List;

/**
 * Created by 索园 on 2017/8/17.
 */
public class Bean {

    /**
     * array : [{"content":"窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？","number":"6","source":"趣闻历史","time":"2016-02-17","title":"解密：窦太后为何更希望让小儿子梁王做太子？","type":"野史"},{"content":"智真长老为何敢于收留行凶杀人的鲁达？解密：智真长老为何敢于收留行凶杀人的鲁达？解密：智真长老为何敢于收留行凶杀人的鲁达？解密：智真长老为何敢于收留行凶杀人的鲁达？解密：智真长老为何敢于收留行凶杀人的鲁达？","number":"6","source":"趣闻历史","time":"2016-02-17","title":"解密：智真长老为何敢于收留行凶杀人的鲁达？","type":"野史"},{"content":"解密：托塔天王李靖为何要多次营救兄弟宋江？解密：托塔天王李靖为何要多次营救兄弟宋江？解密：托塔天王李靖为何要多次营救兄弟宋江？解密：托塔天王李靖为何要多次营救兄弟宋江？解密：托塔天王李靖为何要多次营救兄弟宋江？解密：托塔天王李靖为何要多次营救兄弟宋江？解密：托塔天王李靖为何要多次营救兄弟宋江？解密：托塔天王李靖为何要多次营救兄弟宋江？","number":"6","source":"趣闻历史","time":"2016-02-17","title":"解密：托塔天王李靖为何要多次营救兄弟宋江？","type":"野史"},{"content":"萧十一郎中沈碧君和连城碧都中毒是为什么？萧十一郎中沈碧君和连城碧都中毒是为什么？萧十一郎中沈碧君和连城碧都中毒是为什么？萧十一郎中沈碧君和连城碧都中毒是为什么？萧十一郎中沈碧君和连城碧都中毒是为什么？萧十一郎中沈碧君和连城碧都中毒是为什么？萧十一郎中沈碧君和连城碧都中毒是为什么？萧十一郎中沈碧君和连城碧都中毒是为什么？萧十一郎中沈碧君和连城碧都中毒是为什么？萧十一郎中沈碧君和连城碧都中毒是为什么？萧十一郎中沈碧君和连城碧都中毒是为什么？萧十一郎中沈碧君和连城碧都中毒是为什么？萧十一郎中沈碧君和连城碧都中毒是为什么？萧十一郎中沈碧君和连城碧都中毒是为什么？萧十一郎中沈碧君和连城碧都中毒是为什么？萧十一郎中沈碧君和连城碧都中毒是为什么？","number":"20","source":"趣闻历史","time":"2016-02-17","title":"萧十一郎中沈碧君和连城碧都中毒是为什么？","type":"推荐"},{"content":"四川自贡献天价鱼两条普通鱼1190元四川自贡献天价鱼两条普通鱼1190元四川自贡献天价鱼两条普通鱼1190元四川自贡献天价鱼两条普通鱼1190元四川自贡献天价鱼两条普通鱼1190元四川自贡献天价鱼两条普通鱼1190元四川自贡献天价鱼两条普通鱼1190元四川自贡献天价鱼两条普通鱼1190元四川自贡献天价鱼两条普通鱼1190元四川自贡献天价鱼两条普通鱼1190元","number":"20","source":"趣闻历史","time":"2016-02-17","title":"四川自贡献天价鱼两条普通鱼1190元","type":"推荐"},{"content":"王力宏妻子怀二胎两人相差10岁十分恩爱王力宏妻子怀二胎两人相差10岁十分恩爱王力宏妻子怀二胎两人相差10岁十分恩爱王力宏妻子怀二胎两人相差10岁十分恩爱王力宏妻子怀二胎两人相差10岁十分恩爱王力宏妻子怀二胎两人相差10岁十分恩爱","number":"20","source":"趣闻历史","time":"2016-02-17","title":"王力宏妻子怀二胎两人相差10岁十分恩爱","type":"推荐"},{"content":"倪萍晒护照否认将移民加拿大只是喜欢多雨天气倪萍晒护照否认将移民加拿大只是喜欢多雨天气倪萍晒护照否认将移民加拿大只是喜欢多雨天气倪萍晒护照否认将移民加拿大只是喜欢多雨天气倪萍晒护照否认将移民加拿大只是喜欢多雨天气倪萍晒护照否认将移民加拿大只是喜欢多雨天气倪萍晒护照否认将移民加拿大只是喜欢多雨天气倪萍晒护照否认将移民加拿大只是喜欢多雨天气倪萍晒护照否认将移民加拿大只是喜欢多雨天气倪萍晒护照否认将移民加拿大只是喜欢多雨天气倪萍晒护照否认将移民加拿大只是喜欢多雨天气倪萍晒护照否认将移民加拿大只是喜欢多雨天气","number":"8","source":"趣闻历史","time":"2016-02-17","title":"倪萍晒护照否认将移民加拿大只是喜欢多雨天气","type":"后宫"},{"content":"卫夫子为何能上位汉武帝最迷恋她哪相特殊能力卫夫子为何能上位汉武帝最迷恋她哪相特殊能力卫夫子为何能上位汉武帝最迷恋她哪相特殊能力卫夫子为何能上位汉武帝最迷恋她哪相特殊能力卫夫子为何能上位汉武帝最迷恋她哪相特殊能力卫夫子为何能上位汉武帝最迷恋她哪相特殊能力","number":"8","source":"趣闻历史","time":"2016-02-17","title":"卫夫子为何能上位汉武帝最迷恋她哪相特殊能力","type":"后宫"},{"content":"程序员爱跳槽的次数跟发现一次引力波差不程序员爱跳槽的次数跟发现一次引力波差不程序员爱跳槽的次数跟发现一次引力波差不程序员爱跳槽的次数跟发现一次引力波差不程序员爱跳槽的次数跟发现一次引力波差不程序员爱跳槽的次数跟发现一次引力波差不程序员爱跳槽的次数跟发现一次引力波差不程序员爱跳槽的次数跟发现一次引力波差不","number":"8","source":"趣闻历史","time":"2016-02-17","title":"程序员爱跳槽的次数跟发现一次引力波差不","type":"后宫"},{"content":"翟天临怎么读  翟天临身高及翟天临个人资料简介翟天临怎么读  翟天临身高及翟天临个人资料简介翟天临怎么读  翟天临身高及翟天临个人资料简介翟天临怎么读  翟天临身高及翟天临个人资料简介翟天临怎么读  翟天临身高及翟天临个人资料简介翟天临怎么读  翟天临身高及翟天临个人资料简介翟天临怎么读  翟天临身高及翟天临个人资料简介翟天临怎么读  翟天临身高及翟天临个人资料简介翟天临怎么读  翟天临身高及翟天临个人资料简介翟天临怎么读  翟天临身高及翟天临个人资料简介翟天临怎么读  翟天临身高及翟天临个人资料简介翟天临怎么读  翟天临身高及翟天临个人资料简介翟天临怎么读  翟天临身高及翟天临个人资料简介翟天临怎么读  翟天临身高及翟天临个人资料简介","number":"96","source":"趣闻历史","time":"2016-02-17","title":"翟天临怎么读  翟天临身高及翟天临个人资料简介","type":"解密"},{"content":"李园是如何让亲妹妹 李嫣当上王后的？李园是如何让亲妹妹 李嫣当上王后的？李园是如何让亲妹妹 李嫣当上王后的？李园是如何让亲妹妹 李嫣当上王后的？李园是如何让亲妹妹 李嫣当上王后的？李园是如何让亲妹妹 李嫣当上王后的？李园是如何让亲妹妹 李嫣当上王后的？李园是如何让亲妹妹 李嫣当上王后的？李园是如何让亲妹妹 李嫣当上王后的？","number":"6","source":"趣闻历史","time":"2016-02-17","title":"解密：李园是如何让亲妹妹 李嫣当上王后的？","type":"解密"},{"content":"张学良明知危险为何力排众议护蒋介石回南京？张学良明知危险为何力排众议护蒋介石回南京？张学良明知危险为何力排众议护蒋介石回南京？张学良明知危险为何力排众议护蒋介石回南京？张学良明知危险为何力排众议护蒋介石回南京？张学良明知危险为何力排众议护蒋介石回南京？张学良明知危险为何力排众议护蒋介石回南京？张学良明知危险为何力排众议护蒋介石回南京？张学良明知危险为何力排众议护蒋介石回南京？张学良明知危险为何力排众议护蒋介石回南京？张学良明知危险为何力排众议护蒋介石回南京？张学良明知危险为何力排众议护蒋介石回南京？张学良明知危险为何力排众议护蒋介石回南京？张学良明知危险为何力排众议护蒋介石回南京？","number":"15","source":"趣闻历史","time":"2016-02-17","title":"张学良明知危险为何力排众议护蒋介石回南京？","type":"解密"}]
     * string : Hello World
     */

    private String string;
    private List<ArrayBean> array;

    public String getString() {
        return string;
    }

    public void setString(String string) {
        this.string = string;
    }

    public List<ArrayBean> getArray() {
        return array;
    }

    public void setArray(List<ArrayBean> array) {
        this.array = array;
    }

    public static class ArrayBean implements Serializable{
        /**
         * content : 窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？窦太后为何更希望让小儿子梁王做太子？
         * number : 6
         * source : 趣闻历史
         * time : 2016-02-17
         * title : 解密：窦太后为何更希望让小儿子梁王做太子？
         * type : 野史
         */

        private String content;
        private String number;
        private String source;
        private String time;
        private String title;
        private String type;

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }

        public String getNumber() {
            return number;
        }

        public void setNumber(String number) {
            this.number = number;
        }

        public String getSource() {
            return source;
        }

        public void setSource(String source) {
            this.source = source;
        }

        public String getTime() {
            return time;
        }

        public void setTime(String time) {
            this.time = time;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getType() {
            return type;
        }

        public void setType(String type) {
            this.type = type;
        }
    }
}
